YeatsLiao/ai-passport-bambu-monitor/sdkconfig.defaults
# --- Target chip ---
CONFIG_IDF_TARGET="esp32c3"

# --- Flash: 8MB ---
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n

# --- Partitions: NVS + PHY + 3MB app ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- Console: USB-Serial-JTAG (C3 native USB) ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_MEM_SIZE_KILOBYTES=24

# --- System ---
CONFIG_FREERTOS_HZ=1000

# --- MQTT ---
CONFIG_MQTT_TRANSPORT_SSL=y

# --- TLS: 跳过服务器证书验证（拓竹自签名证书） ---
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
